Repository: salcino/python-docs-it
Catalog: tutorial/appetite.po
Languages: it_it

source: Whetting Your Appetite
it_it: Stuzzichiamo il tuo appetito

source: If you do much work on computers, eventually you find that there's some task you'd like to automate. For example, you may wish to perform a search-and-replace over a large number of text files, or rename and rearrange a bunch of photo files in a complicated way. Perhaps you'd like to write a small custom database, or a specialized GUI application, or a simple game.
it_it: Se si fa molto lavoro sui computer, alla fine si scopre che c'è qualche compito che si desidera automatizzare. Ad esempio, è possibile eseguire un “ricerca e sostituisci” su un gran numero di file di testo, oppure rinominare e riorganizzare un gruppo di file di foto in modo complesso. Magari vi piacerebbe scrivere un piccolo database personalizzato, o un'applicazione GUI specializzata, o un semplice gioco.

source: If you're a professional software developer, you may have to work with several C/C++/Java libraries but find the usual write/compile/test/re-compile cycle is too slow. Perhaps you're writing a test suite for such a library and find writing the testing code a tedious task. Or maybe you've written a program that could use an extension language, and you don't want to design and implement a whole new language for your application.
it_it: Se sei uno sviluppatore di software professionista, potresti dover lavorare con diverse librerie C/C++/Java, ma il solito ciclo di scrittura/compilazione/test/ricompilazione è troppo lento. Forse stai scrivendo una suite di test per una libreria di questo tipo e credi che la scrittura del codice di test sia un compito noioso. O forse avete scritto un programma che potrebbe utilizzare una libreria che usa un proprio linguaggio di programmazione, e non volete progettare e implementare un linguaggio completamente nuovo per la vostra applicazione.

source: Python is just the language for you.
it_it: Python è il linguaggio che fa per te.

source: You could write a Unix shell script or Windows batch files for some of these tasks, but shell scripts are best at moving around files and changing text data, not well-suited for GUI applications or games. You could write a C/C++/Java program, but it can take a lot of development time to get even a first-draft program. Python is simpler to use, available on Windows, macOS, and Unix operating systems, and will help you get the job done more quickly.
it_it: Si potrebbe scrivere uno script di shell Unix o file batch di Windows per alcune di queste attività, tuttavia se è vero che gli script di shell sono i migliori per spostarsi tra i file o modificare i file di testo, non sono adatti per applicazioni GUI o giochi. Si potrebbe scrivere un programma C/C+++/Java, ma può essere necessario molto tempo di sviluppo per ottenere anche solo una prima bozza di programma. Python è più semplice da usare, disponibile su Windows, Mac OS X e Unix, e vi aiuterà a svolgere il lavoro più rapidamente.

source: Python is simple to use, but it is a real programming language, offering much more structure and support for large programs than shell scripts or batch files can offer. On the other hand, Python also offers much more error checking than C, and, being a *very-high-level language*, it has high-level data types built in, such as flexible arrays and dictionaries. Because of its more general data types Python is applicable to a much larger problem domain than Awk or even Perl, yet many things are at least as easy in Python as in those languages.
it_it: Python è semplice da usare, ma è un vero e proprio linguaggio di programmazione, che offre una struttura e un supporto per programmi di grandi dimensioni molto più di quanto possano offrire script di shell o file batch. D'altra parte, Python offre anche molto più controllo degli errori di C e, essendo un linguaggio *di altissimo livello*, ha tipi di dati di alto livello integrati, come array flessibili e dizionari. A causa dei suoi tipi di dati più generali, Python è applicabile ad un dominio molto più grande di Awk o anche di Perl, ma molte cose sono almeno altrettanto facili in Python come in quei linguaggi.

source: Python allows you to split your program into modules that can be reused in other Python programs. It comes with a large collection of standard modules that you can use as the basis of your programs --- or as examples to start learning to program in Python. Some of these modules provide things like file I/O, system calls, sockets, and even interfaces to graphical user interface toolkits like Tk.
it_it: Python permette di suddividere il programma in moduli che possono essere riutilizzati in altri programmi Python. Viene fornito con una vasta collezione di moduli standard che potete usare come base dei vostri programmi --- o come esempi per iniziare ad imparare a programmare in Python. Alcuni di questi moduli forniscono cose come I/O di file, chiamate di sistema, socket e persino strumenti per lo sviluppo di interfacce grafiche utente come Tk.

source: Python is an interpreted language, which can save you considerable time during program development because no compilation and linking is necessary. The interpreter can be used interactively, which makes it easy to experiment with features of the language, to write throw-away programs, or to test functions during bottom-up program development. It is also a handy desk calculator.
it_it: Python è un linguaggio interpretato, che può farvi risparmiare molto tempo durante lo sviluppo del programma perché non è necessaria alcuna compilazione e *linking*. L'interprete può essere usato in modo interattivo, il che rende facile sperimentare con le caratteristiche del linguaggio, scrivere programmi usa e getta o testare le funzioni durante lo sviluppo del programma dal basso verso l'alto. È anche una pratica calcolatrice da tavolo.

source: Python enables programs to be written compactly and readably. Programs written in Python are typically much shorter than equivalent C, C++, or Java programs, for several reasons:
it_it: Python consente di scrivere programmi in modo compatto e leggibile. I programmi scritti in Python sono in genere molto più brevi dei programmi equivalenti in C, C+++ o Java, per diversi motivi:

source: the high-level data types allow you to express complex operations in a single statement;
it_it: i tipi di dati di alto livello consentono di esprimere operazioni complesse in un'unica dichiarazione;

source: statement grouping is done by indentation instead of beginning and ending brackets;
it_it: il raggruppamento delle istruzioni è fatto usando l’indentazione invece che per parentesi iniziali e finali;

source: no variable or argument declarations are necessary.
it_it: non sono necessarie dichiarazioni di variabili o argomenti.

source: Python is *extensible*: if you know how to program in C it is easy to add a new built-in function or module to the interpreter, either to perform critical operations at maximum speed, or to link Python programs to libraries that may only be available in binary form (such as a vendor-specific graphics library). Once you are really hooked, you can link the Python interpreter into an application written in C and use it as an extension or command language for that application.
it_it: Python è *estensibile*: se si conosce la programmazione in C è facile aggiungere una nuova funzione o un modulo all'interprete, sia per eseguire operazioni critiche alla massima velocità, sia per collegare programmi Python a librerie che possono essere disponibili solo in forma di eseguibili binari (come una libreria grafica fornita da un fornitore). Una volta che ci si è fatto il callo, è possibile anche collegare l'interprete Python ad un'applicazione scritta in C e usarlo come un’estensione o come linguaggio per impartire comandi a quell'applicazione.

source: By the way, the language is named after the BBC show "Monty Python's Flying Circus" and has nothing to do with reptiles. Making references to Monty Python skits in documentation is not only allowed, it is encouraged!
it_it: A proposito, la lingua prende il nome dallo show della BBC "Monty Python's Flying Circus" e non ha nulla a che fare con i rettili. Fare riferimento agli schetch Monty Python nella documentazione non solo è permesso, ma è incoraggiato!

source: Now that you are all excited about Python, you'll want to examine it in some more detail. Since the best way to learn a language is to use it, the tutorial invites you to play with the Python interpreter as you read.
it_it: Ora che siete tutti entusiasti di Python, vorrete esaminarlo più in dettaglio. Poiché il modo migliore per imparare un linguaggio è usarlo, il tutorial vi invita a giocare con l'interprete Python mentre lo leggete.

source: In the next chapter, the mechanics of using the interpreter are explained. This is rather mundane information, but essential for trying out the examples shown later.
it_it: Nel capitolo successivo vengono spiegate le modalità di utilizzo dell'interprete. Si tratta di informazioni piuttosto banali, ma essenziali per provare gli esempi mostrati in seguito.

source: The rest of the tutorial introduces various features of the Python language and system through examples, beginning with simple expressions, statements and data types, through functions and modules, and finally touching upon advanced concepts like exceptions and user-defined classes.
it_it: Il resto del tutorial introduce varie caratteristiche del linguaggio e del sistema Python attraverso esempi, iniziando con semplici espressioni, comandi e tipi di dati, attraverso funzioni e moduli, e infine toccando concetti avanzati come eccezioni e classi definite dall'utente.
